---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CeilingAttrPatternParam
source: html/9bab59c8-82a0-5ecb-c9f2-56888f464e46.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CeilingAttrPatternParam Property

"Pattern"

## Syntax (C#)
```csharp
public static ForgeTypeId CeilingAttrPatternParam { get; }
```